app/controllers/products_controller.rb

INSERT INTO `products` (`category`, `created_at`, `name`, `price`, `updated_at`) VALUES ('fgfd', '2013-07-01 08:54:07', 'sadsf', NULL, '2013-07-01 08:54:07')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `price` = 3454, `updated_at` = '2013-07-01 08:54:12' WHERE `products`.`id` = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])